Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/include/pio/pic32cm5164ls00064.h
#define PIN_PB12H_GCLK_IO6                         _UL_(44)    
#define MUX_PB12H_GCLK_IO6                         _UL_(7)     
#define PINMUX_PB12H_GCLK_IO6                      ((PIN_PB12H_GCLK_IO6 << 16) | MUX_PB12H_GCLK_IO6)
#define PORT_PB12H_GCLK_IO6                        (_UL_(1) << 12)

#define PIN_PB13H_GCLK_IO7                         _UL_(45)    
#define MUX_PB13H_GCLK_IO7                         _UL_(7)     
#define PINMUX_PB13H_GCLK_IO7                      ((PIN_PB13H_GCLK_IO7 << 16) | MUX_PB13H_GCLK_IO7)
#define PORT_PB13H_GCLK_IO7                        (_UL_(1) << 13)

/* ========== PORT definition for I2S peripheral ========== */
#define PIN_PA11K_I2S_FS0                          _UL_(11)    
#define MUX_PA11K_I2S_FS0                          _UL_(10)    
#define PINMUX_PA11K_I2S_FS0                       ((PIN_PA11K_I2S_FS0 << 16) | MUX_PA11K_I2S_FS0)
#define PORT_PA11K_I2S_FS0                         (_UL_(1) << 11)

#define PIN_PA18K_I2S_FS0                          _UL_(18)    
#define MUX_PA18K_I2S_FS0                          _UL_(10)    
#define PINMUX_PA18K_I2S_FS0                       ((PIN_PA18K_I2S_FS0 << 16) | MUX_PA18K_I2S_FS0)
#define PORT_PA18K_I2S_FS0                         (_UL_(1) << 18)

#define PIN_PB12K_I2S_FS1                          _UL_(44)    
#define MUX_PB12K_I2S_FS1                          _UL_(10)    
#define PINMUX_PB12K_I2S_FS1                       ((PIN_PB12K_I2S_FS1 << 16) | MUX_PB12K_I2S_FS1)
#define PORT_PB12K_I2S_FS1                         (_UL_(1) << 12)

#define PIN_PA09K_I2S_MCK0                         _UL_(9)     
#define MUX_PA09K_I2S_MCK0                         _UL_(10)    
#define PINMUX_PA09K_I2S_MCK0                      ((PIN_PA09K_I2S_MCK0 << 16) | MUX_PA09K_I2S_MCK0)
#define PORT_PA09K_I2S_MCK0                        (_UL_(1) << 9)

#define PIN_PB13K_I2S_MCK1                         _UL_(45)    
#define MUX_PB13K_I2S_MCK1                         _UL_(10)    
#define PINMUX_PB13K_I2S_MCK1                      ((PIN_PB13K_I2S_MCK1 << 16) | MUX_PB13K_I2S_MCK1)
#define PORT_PB13K_I2S_MCK1                        (_UL_(1) << 13)

#define PIN_PA10K_I2S_SCK0                         _UL_(10)    
#define MUX_PA10K_I2S_SCK0                         _UL_(10)    
#define PINMUX_PA10K_I2S_SCK0                      ((PIN_PA10K_I2S_SCK0 << 16) | MUX_PA10K_I2S_SCK0)
#define PORT_PA10K_I2S_SCK0                        (_UL_(1) << 10)

#define PIN_PA20K_I2S_SCK0                         _UL_(20)    
#define MUX_PA20K_I2S_SCK0                         _UL_(10)    
#define PINMUX_PA20K_I2S_SCK0                      ((PIN_PA20K_I2S_SCK0 << 16) | MUX_PA20K_I2S_SCK0)
#define PORT_PA20K_I2S_SCK0                        (_UL_(1) << 20)

#define PIN_PA21K_I2S_SCK1                         _UL_(21)    
#define MUX_PA21K_I2S_SCK1                         _UL_(10)    
#define PINMUX_PA21K_I2S_SCK1                      ((PIN_PA21K_I2S_SCK1 << 16) | MUX_PA21K_I2S_SCK1)
#define PORT_PA21K_I2S_SCK1                        (_UL_(1) << 21)

#define PIN_PA08K_I2S_SDI                          _UL_(8)     
#define MUX_PA08K_I2S_SDI                          _UL_(10)    
#define PINMUX_PA08K_I2S_SDI                       ((PIN_PA08K_I2S_SDI << 16) | MUX_PA08K_I2S_SDI)
#define PORT_PA08K_I2S_SDI                         (_UL_(1) << 8)

#define PIN_PB16K_I2S_SDI                          _UL_(48)    
#define MUX_PB16K_I2S_SDI                          _UL_(10)    
#define PINMUX_PB16K_I2S_SDI                       ((PIN_PB16K_I2S_SDI << 16) | MUX_PB16K_I2S_SDI)
#define PORT_PB16K_I2S_SDI                         (_UL_(1) << 16)

#define PIN_PA19K_I2S_SDO                          _UL_(19)    
#define MUX_PA19K_I2S_SDO                          _UL_(10)    
#define PINMUX_PA19K_I2S_SDO                       ((PIN_PA19K_I2S_SDO << 16) | MUX_PA19K_I2S_SDO)
#define PORT_PA19K_I2S_SDO                         (_UL_(1) << 19)

/* ========== PORT definition for OPAMP peripheral ========== */
#define PIN_PA02B_OPAMP_OANEG0                     _UL_(2)     
#define MUX_PA02B_OPAMP_OANEG0                     _UL_(1)     
#define PINMUX_PA02B_OPAMP_OANEG0                  ((PIN_PA02B_OPAMP_OANEG0 << 16) | MUX_PA02B_OPAMP_OANEG0)
#define PORT_PA02B_OPAMP_OANEG0                    (_UL_(1) << 2)

#define PIN_PA00B_OPAMP_OANEG1                     _UL_(0)     
#define MUX_PA00B_OPAMP_OANEG1                     _UL_(1)     
#define PINMUX_PA00B_OPAMP_OANEG1                  ((PIN_PA00B_OPAMP_OANEG1 << 16) | MUX_PA00B_OPAMP_OANEG1)
#define PORT_PA00B_OPAMP_OANEG1                    (_UL_(1) << 0)

#define PIN_PA03B_OPAMP_OANEG2                     _UL_(3)     
#define MUX_PA03B_OPAMP_OANEG2                     _UL_(1)     
#define PINMUX_PA03B_OPAMP_OANEG2                  ((PIN_PA03B_OPAMP_OANEG2 << 16) | MUX_PA03B_OPAMP_OANEG2)
#define PORT_PA03B_OPAMP_OANEG2                    (_UL_(1) << 3)

#define PIN_PA07B_OPAMP_OAOUT0                     _UL_(7)     
#define MUX_PA07B_OPAMP_OAOUT0                     _UL_(1)     
#define PINMUX_PA07B_OPAMP_OAOUT0                  ((PIN_PA07B_OPAMP_OAOUT0 << 16) | MUX_PA07B_OPAMP_OAOUT0)
#define PORT_PA07B_OPAMP_OAOUT0                    (_UL_(1) << 7)

#define PIN_PB04B_OPAMP_OAOUT1                     _UL_(36)    
#define MUX_PB04B_OPAMP_OAOUT1                     _UL_(1)     
#define PINMUX_PB04B_OPAMP_OAOUT1                  ((PIN_PB04B_OPAMP_OAOUT1 << 16) | MUX_PB04B_OPAMP_OAOUT1)
#define PORT_PB04B_OPAMP_OAOUT1                    (_UL_(1) << 4)

#define PIN_PA04B_OPAMP_OAOUT2                     _UL_(4)     
#define MUX_PA04B_OPAMP_OAOUT2                     _UL_(1)     
#define PINMUX_PA04B_OPAMP_OAOUT2                  ((PIN_PA04B_OPAMP_OAOUT2 << 16) | MUX_PA04B_OPAMP_OAOUT2)
#define PORT_PA04B_OPAMP_OAOUT2                    (_UL_(1) << 4)

#define PIN_PA06B_OPAMP_OAPOS0                     _UL_(6)     
#define MUX_PA06B_OPAMP_OAPOS0                     _UL_(1)     
#define PINMUX_PA06B_OPAMP_OAPOS0                  ((PIN_PA06B_OPAMP_OAPOS0 << 16) | MUX_PA06B_OPAMP_OAPOS0)
#define PORT_PA06B_OPAMP_OAPOS0                    (_UL_(1) << 6)

